NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_flpr_peripherals.h
#define MEMCONF_MULTIPLE_INSTANCES 1                 /*!< There are multiple MEMCONFs present in this product. See the details
                                                          below for the attributes per MEMCONF instance.*/
#define MEMCONF_NRAMS_MIN 0                          /*!< Number of MEMCONF pages: [0..1]                                      */
#define MEMCONF_NRAMS_MAX 1                          /*!< Number of MEMCONF pages: [0..1]                                      */
#define MEMCONF_NRAMS_SIZE 2                         /*!< Number of MEMCONF pages: [0..1]                                      */
#define MEMCONF_POWER 1                              /*!< (unspecified)                                                        */
#define MEMCONF_CONTROL_RESET_N0 0xF0000000          /*!< Reset value of register POWER[0].CONTROL: 0xF0000000                 */
#define MEMCONF_CONTROL_RESET_N1 0x0000000E          /*!< Reset value of register POWER[1].CONTROL: 0x0000000E                 */
#define MEMCONF_RETENTION_RESET_N0 0xFFFFFFFF        /*!< Reset value of register POWER[0].RET: 0xFFFFFFFF                     */
#define MEMCONF_RETENTION_RESET_N1 0x0000000E        /*!< Reset value of register POWER[1].RET: 0x0000000E                     */
#define MEMCONF_RETENTION2_RESET_N0 0xFFFFFFFF       /*!< Reset value of register POWER[0].RET2: 0xFFFFFFFF                    */
#define MEMCONF_RETENTION2_RESET_N1 0x00000000       /*!< Reset value of register POWER[1].RET2: 0x00000000                    */
#define MEMCONF_RETTRIM 1                            /*!< (unspecified)                                                        */

/*Pulse Density Modulation (Digital Microphone) Interface*/
#define PDM_PRESENT 1
#define PDM_COUNT 2

#define PDM20_SAMPLE16 0                             /*!< (unspecified)                                                        */
#define PDM20_SAMPLE48 1                             /*!< Supports 8, 16, 32, 48 kHz sample rate.                              */
#define PDM20_PRESCALER_PRESENT 1                    /*!< (unspecified)                                                        */
#define PDM20_PDMV2 1                                /*!< (unspecified)                                                        */
#define PDM20_PCLK24M 0                              /*!< (unspecified)                                                        */
#define PDM20_AUDIOPLL 1                             /*!< (unspecified)                                                        */
#define PDM20_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< CURRENTAMOUNT register included.                                 */

#define PDM21_SAMPLE16 0                             /*!< (unspecified)                                                        */
#define PDM21_SAMPLE48 1                             /*!< Supports 8, 16, 32, 48 kHz sample rate.                              */
#define PDM21_PRESCALER_PRESENT 1                    /*!< (unspecified)                                                        */
#define PDM21_PDMV2 1                                /*!< (unspecified)                                                        */
#define PDM21_PCLK24M 0                              /*!< (unspecified)                                                        */
#define PDM21_AUDIOPLL 1                             /*!< (unspecified)                                                        */
#define PDM21_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< CURRENTAMOUNT register included.                                 */

/*Pulse width modulation unit*/
#define PWM_PRESENT 1
#define PWM_COUNT 3

#define PWM20_IDLE_OUT 1                             /*!< IDLEOUT register is available.                                       */
#define PWM20_COMPARE_MATCH 1                        /*!< EVENTS_COMPAREMATCH events are available.                            */
#define PWM20_FEATURES_V2 0                          /*!< (unspecified)                                                        */
#define PWM20_NO_FEATURES_V2 1                       /*!< (unspecified)                                                        */
#define PWM20_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< CURRENTAMOUNT register included.                                 */

#define PWM21_IDLE_OUT 1                             /*!< IDLEOUT register is available.                                       */
#define PWM21_COMPARE_MATCH 1                        /*!< EVENTS_COMPAREMATCH events are available.                            */
#define PWM21_FEATURES_V2 0                          /*!< (unspecified)                                                        */
#define PWM21_NO_FEATURES_V2 1                       /*!< (unspecified)                                                        */
#define PWM21_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< CURRENTAMOUNT register included.                                 */

#define PWM22_IDLE_OUT 1                             /*!< IDLEOUT register is available.                                       */
#define PWM22_COMPARE_MATCH 1                        /*!< EVENTS_COMPAREMATCH events are available.                            */
#define PWM22_FEATURES_V2 0                          /*!< (unspecified)                                                        */
#define PWM22_NO_FEATURES_V2 1                       /*!< (unspecified)                                                        */
#define PWM22_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< CURRENTAMOUNT register included.                                 */

/*Analog to Digital Converter*/
#define SAADC_PRESENT 1
#define SAADC_COUNT 1

#define SAADC_CHOPPING 1                             /*!< (unspecified)                                                        */
#define SAADC_BURSTREG 1                             /*!< (unspecified)                                                        */
#define SAADC_PSEL_V2 1                              /*!< (unspecified)                                                        */
#define SAADC_TASKS_CALIBRATEGAIN 1                  /*!< (unspecified)                                                        */
#define SAADC_SAMPLERATE_CC_VALUERANGE_MIN 8         /*!< (unspecified)                                                        */
#define SAADC_SAMPLERATE_CC_VALUERANGE_MAX 2047      /*!< (unspecified)                                                        */
#define SAADC_SAMPLERATE_CC_VALUERANGE_SIZE 2048     /*!< (unspecified)                                                        */
#define SAADC_TACQ_VALUE_RANGE_MIN 1                 /*!< (unspecified)                                                        */
#define SAADC_TACQ_VALUE_RANGE_MAX 319               /*!< (unspecified)                                                        */
#define SAADC_TACQ_VALUE_RANGE_SIZE 320              /*!< (unspecified)                                                        */
#define SAADC_TCONV_VALUE_RANGE_MIN 1                /*!< (unspecified)                                                        */
#define SAADC_TCONV_VALUE_RANGE_MAX 7                /*!< (unspecified)                                                        */
#define SAADC_TCONV_VALUE_RANGE_SIZE 8               /*!< (unspecified)                                                        */
#define SAADC_HAS_EVENTSCANDONE 0                    /*!< (unspecified)                                                        */
#define SAADC_AVSS_PUBLIC 1                          /*!< AVSS (analog ground) option in PSELN.TEST field is public            */
#define SAADC_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< CURRENTAMOUNT register not included.                             */

/*NFC-A compatible radio NFC-A compatible radio*/
#define NFCT_PRESENT 1
#define NFCT_COUNT 1

#define NFCT_HAS_INTPEND 0                           /*!< (unspecified)                                                        */
#define NFCT_NFCTFIELDDETCFG_RESET 1                 /*!< Reset value of register NFCTFIELDDETCFG: 1                           */

